IDEA Open Model
ReinfBarSurface Enumeration
Compatible with IDEA StatiCa v 10.1
 Reinforcement bar surface
 Namespace: IdeaRS.OpenModel.Material
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public enum ReinfBarSurface
Public Enumeration ReinfBarSurface
public enum class ReinfBarSurface
Members
Member name | Value | Description
Smooth | 0 |  Smooth bar surface
Ribbed | 1 |  Ribbed bar surface
See Also
Reference
IdeaRS.OpenModel.Material Namespace